Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ཨེ་མ་དེ་བཞིན་གཤེགས་པ་འདི་སྐྱེས་མ་ཐག་ཏུ་སྟེང་གི་ནམ་མཁའ་ལ་ཏ་ལ་བདུན་སྲིད་དུ་འཕགས་ནས་གོམ་པ་བདུན་བོར་ཏེ། དངོས་པོ་མེད་པའི་སྒྲ་འབྱིན་པ་ལས་ན་དངོས་པོ་མེད་པ་ལས་བྱུང་བ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་མཚན་དངོས་པོ་མེད་པ་ལས་བྱུང་བ།
en: ‘Oh, as soon as this tathāgata was born, he rose in the air up to the height of seven palm trees, took seven steps and said the word nonexistence. Therefore he will be Abhāva­samudgata (Arisen from Nonexistence).’ Thus it was that the name Abhāva­samudgata arose, and that he was given the name Abhāva­samudgata.

source: དངོས་པོ་མེད་པ་ལས་བྱུང་བའོ་ཞེས་བཏགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བྱང་ཆུབ་ཐོབ་པ་ན་ཤིང་ཐམས་ཅད་ཀྱི་ལོ་མ་དང་རྩ་བ་དང་ཤིང་གེལ་པ་དང་ནགས་ཚལ་ཐམས་ཅད་དང་རིའི་རྩེ་མོ་ཐམས་ཅད་ལས་ཀྱང་དངོས་པོ་མེད་པ་ལས་བྱུང་བའོ་ཞེས་སྒྲ་བྱུང་ངོ་།
en: “When that bhagavān attained enlightenment, the words ‘arisen from nonexistence’ sounded from the leaves of all the trees, from all the grass, bushes, and forests, and from the summits of all the mountains.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སྒྲར་བཏགས་པ་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ལས་དངོས་པོ་མེད་པ་ལས་བྱུང་བའོ་ཞེས་རྣམ་པར་རིག་པར་བྱེད་པའི་སྒྲ་བྱུང་ངོ་།
en: “Every sound in that world was heard as the words ‘arisen from nonexistence.’

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དངོས་པོ་མེད་པ་ལས་བྱུང་བ་དེའི་གསུང་རབ་ལ་རྒྱལ་བུ་གཞོན་ནུ་སྙིང་རྗེ་ཆེན་པོ་སེམས་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཞིག་བྱུང་ངོ་།
en: “Young man, at the time, attending the teachings of the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Abhāva­samudgata, there was a young prince by the name of Mahā­karuṇā­cintin, who had an excellent body and was handsome and good-looking.

source: །གཞོན་ནུ་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་སྙིང་རྗེ་ཆེན་པོ་སེམས་དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དངོས་པོ་མེད་པ་ལས་བྱུང་བ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: “Young man, the prince went to the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Abhāva­samudgata and bowed his head to the Bhagavān’s feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: He circumambulated the Bhagavān three times and then sat down.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དངོས་པོ་མེད་པ་ལས་བྱུང་བས་རྒྱལ་བུ་གཞོན་ནུ་སྙིང་རྗེ་ཆེན་པོ་སེམས་ཀྱི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཏིང་ངེ་འཛིན་འདི་བཤད་དོ།
en: Then the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Abhāva­samudgata, knowing the higher motivation of Prince Mahā­karuṇā­cintin, taught him this samādhi.

source: །དེ་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་རབ་ཏུ་དད་དེ་སེམས་རབ་ཏུ་དད་པས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་གྱོན་ནས་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་།
en: When he had heard this he had complete faith in it. With complete faith he shaved off his hair and beard, put on the orange robes, and with such faith left home for homelessness.

source: །དེ་རབ་ཏུ་བྱུང་ནས་ཏིང་ངེ་འཛིན་འདི་བཟུང་སྟེ།
en: Having entered homelessness he learned this samādhi.

source: །བཟུང་ཞིང་བཅངས་བཀླགས་ཀུན་ཆུབ་པར་བྱས་ནས་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་གནས་ཏེ།
en: He learned it, kept it, read it, understood it, and dedicated himself to the practice of meditation on it.

source: དེ་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་བྱེ་བ་ཕྲག་ཉི་ཤུར་ནམ་ཡང་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་།
en: Through that root of merit, he did not fall into the lower existences for two hundred million eons.

source: །སངས་རྒྱས་བྱེ་བ་ཕྲག་ཉི་ཤུ་མཉེས་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་མཉན་ཏོ།
en: He served two hundred million buddhas, and he heard this samādhi from all those tathāgatas.

source: །སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ལས་མཉན་ནས་ཀྱང་བཟུང་ངོ་ཀུན་ཆུབ་པར་བྱས་སོ།
en: Having heard it, he learned it and understood it.

source: །བཅངས་སོ། །བཀླགས་སོ། །བཏོན་ཏོ། །ཉོན་མོངས་པ་མེད་པར་བསྒོམས་ཤིང་མང་དུ་བྱས་ཏེ། བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་གནས་སོ།
en: He kept it, read it, propagated it, and repeatedly meditated on it with unadulterated meditation, remaining dedicated to that practice of meditation.

source: །དེ་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་ཉི་ཤུ་འདས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་ལེགས་པར་བསམས་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Through those roots of merit, after twenty eons had passed he appeared in the world as the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Suvicintitārtha.

source: དེས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱས་སེམས་ཅན་ཚད་མེད་པའི་དོན་བྱས་ནས་དེའི་འོག་ཏུ་ཤིང་ཟད་པའི་མེ་ལྟར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: He ripened countless beings and benefited countless beings, and afterward, like an extinguished flame, he passed away into perfect nirvāṇa.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་ཏིང་ངེ་འཛིན་འདི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཅེས་སྤྲས་བྱེད་པ་སྟེ།
en: “Therefore, young man, this samādhi of that Dharma teaching should be cherished by bodhisattva mahāsattvas.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བླ་ན་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: It should be known to cause the unsurpassable perfect wisdom of buddhahood.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་ལེའུ་འདི་ཉིད་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Then at that time the Bhagavān gave a detailed teaching on the preceding chapter by chanting the following extensive verses to the youth Candraprabha:

source: །སྔོན་འདས་དུས་ཀྱི་བསྐལ་པ་བསམ་ཡས་ན། །མི་ཡི་གཙོ་བོ་བྱུང་བ་ངས་དྲན་ཏེ།
en: “I remember that countless eons ago In the past, there appeared a supreme human,

source: །དྲང་སྲོང་ཆེན་པོ་གཟེངས་ཀྱིས་དོན་མཛད་པ།
en: One who benefited the world, a great rishi,

source: །དེ་མིང་དངོས་པོ་མེད་ལས་བྱུང་ཞེས་བྱ།
en: And his name was Abhāva­samudgata. {1}

source: །སྐྱེས་མ་ཐག་ཏུ་མཁའ་ལ་རབ་འདུག་ནས།
en: “As soon as he was born he rose into the air

source: །ཆོས་རྣམས་ཐམས་ཅད་དངོས་པོ་མེད་པར་བསྟན།
en: And taught the nonexistence of all phenomena.

source: །དེ་ཚེ་དེ་དང་འཐུན་པར་མཚན་བཏགས་ཏེ།
en: He was at that time given a corresponding name

source: །སྒྲས་ནི་འཇིག་རྟེན་ཀུན་ཏུ་གྲགས་པར་བྱས།
en: And his words were heard throughout the trichiliocosm. {2}

source: །ལྷ་རྣམས་ཐམས་ཅད་རབ་ཏུ་སྒྲ་འབྱིན་པ།
en: “All the devas, they all called out,

source: །དངོས་པོ་མེད་ཅེས་བྱ་བའི་རྒྱལ་བར་འགྱུར།
en: ‘He will be a jina named Abhāva!

source: །སྐྱེས་མ་ཐག་ཏུ་གོམ་པ་བདུན་བོར་ཏེ།
en: As soon as he was born he took seven steps

source: །རྒྱལ་བས་ཆོས་རྣམས་དངོས་པོ་མེད་པར་བཤད། །ཐུབ་པ་ཆོས་རྣམས་ཐམས་ཅད་སྟོན་པ་ཡི།
en: And the Jina taught the nonexistence of phenomena.’ {3}

source: །སངས་རྒྱས་ཆོས་ཀྱི་རྒྱལ་པོར་ནམ་འགྱུར་ཚེ།
en: “When the sage became a buddha, a Dharma king, Who taught the nature of all phenomena,

source: །རྩི་ཤིང་གེལ་བ་རི་དང་བྲག་རྣམས་ལས།
en: From plants, trees, bushes, mountains, and rocks

source: །ཆོས་རྣམས་དངོས་པོ་མེད་ཅེས་སྒྲ་ཡང་བྱུང་།
en: There came the words ‘phenomena have no existence.’ {4}

source: །འཇིག་རྟེན་དེ་ན་ཇི་སྙེད་སྒྲ་ཡོད་པ།
en: “All the sounds there were in the world

source: །ཐམས་ཅད་དངོས་མེད་ཅི་ཡང་མེད་པ་ཞེས།
en: Became the words ‘all are nonexistent.’

source: །དེ་ལྟ་བུར་ནི་འཇིག་རྟེན་འདྲེན་པ་ཡི། །སྒྲ་དབྱངས་རྣམ་པ་ཤིན་ཏུ་བྱུང་བར་གྱུར།
en: In that way there sounded The words of the Guide of the World. {5}

source: །དེ་ཡི་དུས་ན་རྒྱལ་པོའི་བུ་སྐྱེས་པ།
en: “At that time there was a prince

source: །མིང་ནི་རྟག་ཏུ་སྙིང་རྗེ་སེམས་ཞེས་བྱ།
en: Whose name had always been Karuṇāvicintin.

source: །ཤིན་ཏུ་གཟུགས་བཟང་བལྟ་ན་སྡུག་པ་ཞིག །རྒྱལ་བ་དེ་ཡི་དྲུང་དུ་ཉེར་འོངས་ཏེ།
en: He had an excellent form and was handsome. He came into the presence of that jina. {6}

source: །ཐུབ་པ་ཁྱུ་མཆོག་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: “He bowed to the feet of the sage, that great being,

source: །རི་མོར་བཅས་པས་བསྐོར་བར་བྱས་ནས་ནི།
en: And respectfully circumambulated him.

source: །རྡུལ་བྲལ་བླ་ན་མེད་པའི་ཆོས་མཉན་ཕྱིར།
en: In order to hear the stainless, unsurpassable Dharma

source: །རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་དེར་འདུག་གོ།
en: He sat there with a devout mind. {7}

source: །རྒྱལ་བ་དཔའ་བོ་དེས་ནི་བསམ་མཁྱེན་ནས།
en: “The heroic Jina, knowing his aspiration,

source: །ཏིང་འཛིན་འདི་ནི་རབ་ཏུ་བཤད་པ་མཛད།
en: Gave the teaching of this samādhi.

source: །དེས་ནི་རྡུལ་བྲལ་ཏིང་འཛིན་འདི་ཐོས་ནས།
en: Having listened to this stainless samādhi

source: །རྒྱལ་མཆོག་བསྟན་ལ་མྱུར་བར་རབ་ཏུ་བྱུང་།
en: He quickly entered homelessness in the supreme Jina’s teaching. {8} “Having entered homelessness he possessed,

source: །རབ་ཏུ་དེ་བྱུང་ཏིང་འཛིན་འདི་ཡང་ནི། །བཟུང་ཞིང་བཀླགས་ཏེ་ཡོངས་སུ་ཆུབ་བྱས་པས།
en: Read, and understood this samādhi.

source: །ལོག་པར་ལྟུང་བའི་སར་ཡང་ཡོང་མ་སོང་།
en: He did not descend to an unfortunate existence. {9}

source: །དེ་ནི་དགེ་བར་བྱས་པའི་ལས་དེ་ཡིས།
en: “Through the good karma that he had made

source: །སངས་རྒྱས་བྱེ་ཕྲག་ཉི་ཤུ་མཉེས་པར་བྱས།
en: He pleased two hundred million buddhas,

source: །རྒྱལ་བ་དེ་དག་ཀུན་གྱི་དྲུང་དུ་ཡང་།
en: And in the presence of those jinas

source: །ཏིང་འཛིན་ཞི་མཆོག་འདི་ནི་གོམས་པར་བྱས།
en: He cultivated this samādhi. {10}

source: །དེ་ཕྱིས་འཇིག་རྟེན་དུ་ཡང་སངས་རྒྱས་གྱུར།
en: “He afterward became a buddha in the world

source: །མིང་ནི་དོན་ལེགས་བསམས་ཞེས་རྟག་ཏུ་བརྗོད།
en: Who was always known as Sucintitārtha.

source: །སེམས་ཅན་བྱེ་བ་མང་པོའི་དོན་བྱས་ནས།
en: He benefited many millions of beings

source: །དངོས་པོ་མེད་པ་ལས་བྱུང་བའི་ལེའུ་སྟེ་བརྒྱད་པའོ།། །།
en: Conclusion of the eighth chapter, “Buddha Abhāva­samudgata.”

source: འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་གསུམ་པ།
en: The Patience of the Profound Dharma Chapter 9

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཇི་ལྟར་ན་བདག་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞིང་། སེམས་ཅན་ཐམས་ཅད་སྲིད་པའི་རྒྱ་མཚོ་ལས་བསྒྲལ་བར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྔགས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདི་མཉན་པར་བྱ། །གཟུང་བར་བྱ། བཅང་བར་བྱ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas who wish to attain quickly the highest, complete enlightenment of perfect buddhahood and liberate all beings from the ocean of existence should hear this king of samādhis, in which the equality of the nature of all phenomena is revealed, which is praised by all the buddhas and is the mother of the tathāgatas.

source: ཀུན་ཆུབ་པར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་ནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པར་སྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They should obtain it, preserve it, understand it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others. “Why is that?

source: གཞོན་ནུ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སྐྱེད་པ་སྟེ།
en: Young man, this king of samādhis, the revealed equality of the nature of all phenomena, has given birth to all the tathāgatas, the arhats, the perfectly enlightened buddhas;

source: འདི་ལས་དེ་བཞིན་གཤེགས་པ་དང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་བྱུང་ངོ་།
en: all tathāgatas, śrāvakas, and pratyekabuddhas have come from it.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྔགས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེད་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་གཟུང་བར་བྱའོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: “Therefore, young man, you also should obtain this king of samādhis, the revealed equality of the nature of all phenomena, which is praised by all the buddhas and is the mother of the tathāgatas. It has been said:

source: དེ་ཕྱིར་བྱང་ཆུབ་ཏུ་ནི་འཚང་རྒྱ་ཞིང་།
en: “Therefore, those who wish for enlightenment and buddhahood,

source: །སྲིད་པའི་མཚོ་ལས་སེམས་ཅན་སྒྲོལ་འདོད་པས།
en: And to liberate beings from the ocean of existence,

source: །སངས་རྒྱས་བསྔགས་པའི་མདོ་སྡེ་འདི་ཟུང་ཤིག །བྱང་ཆུབ་དམ་པ་རྙེད་པར་དཀའ་མི་འགྱུར།
en: Should obtain this sūtra praised by the buddhas, And then sublime enlightenment will not be difficult to attain.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཆོས་ཟབ་མོ་བཟོད་པ་ལ་མཁས་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas who wish to attain quickly the highest, complete enlightenment of perfect buddhahood should become skilled in the patience of profound Dharma.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཟབ་མོ་བཟོད་པ་ལ་མཁས་པ་ཡིན་ཞེ་ན།
en: “Young man, how do bodhisattva mahāsattvas become skilled in the patience of profound Dharma?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་རབ་ཏུ་ཤེས་པར་བྱའོ།
en: “Young man, bodhisattva mahāsattvas should know that all phenomena are like illusions.

source: །ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་དང་སྨིག་རྒྱུ་ལྟ་བུ་དང་བྲག་ཅ་ལྟ་བུ་དང་མིག་ཡོར་ལྟ་བུ་དང་ཆུ་ཟླ་ལྟ་བུ་དང་སྤྲུལ་པ་ལྟ་བུ་དང་གཟུགས་བརྙན་ལྟ་བུ་དང་ནམ་མཁའ་ལྟ་བུར་རབ་ཏུ་ཤེས་པར་བྱའོ།
en: They should know that all phenomena are like dreams, like mirages, like echoes, like optical illusions, like the moon on water, like hallucinations, like reflections, and like space.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནམ་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་ཡོངས་སུ་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་དང་སྨིག་རྒྱུ་ལྟ་བུ་དང་བྲག་ཅ་ལྟ་བུ་དང་མིག་ཡོར་ལྟ་བུ་དང་ཆུ་ཟླ་ལྟ་བུ་དང་སྤྲུལ་པ་ལྟ་བུ་དང་གཟུགས་བརྙན་ལྟ་བུ་དང་ནམ་མཁའ་ལྟ་བུར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པ་དེའི་ཚེ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ཆོས་ཟབ་མོ་བཟོད་པ་ལ་མཁས་པ་ཞེས་བྱའོ།
en: “Young man, when bodhisattva mahāsattvas know that all phenomena are like illusions, they are skilled in the patience of profound Dharma.

source: །ཆོས་ཟབ་མོ་བཟོད་པ་དང་ལྡན་པ་དེ་འདོད་ཆགས་པར་འགྱུར་བའི་ཆོས་ལ་མི་ཆགས། ཞེ་སྡང་བར་འགྱུར་བའི་ཆོས་ལ་མི་སྡང་། གཏི་མུག་པར་འགྱུར་བའི་ཆོས་ལ་མི་རྨོངས་སོ།
en: Those who have the patience of profound Dharma have no desire for any phenomenon that causes desire, have no anger toward any phenomenon that causes anger, and have no ignorance regarding any phenomenon that causes ignorance.

source: འདི་ལྟར་དེས་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: It is because they do not see that phenomenon;

source: གང་འདོད་ཆགས་པ་དང་གང་ལ་འདོད་ཆགས་པ་དང་གང་གིས་འདོད་ཆགས་པ་དང་གང་ཞེ་སྡང་བ་དང་གང་ལ་ཞེ་སྡང་བ་དང་གང་གིས་ཞེ་སྡང་བ་དང་གང་གཏི་མུག་པ་དང་གང་ལ་གཏི་མུག་པ་དང་གང་གིས་གཏི་མུག་པར་འགྱུར་བའི་ཆོས་དེ་དེས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་ཆོས་དེ་མི་དམིགས་སོ།
en: They do not see the phenomena and they do not perceive the phenomena of that which is desired, the desire, or the desirer; that which angers, the anger, or one who is angry; nor that of which one is ignorant, the ignorance, or the one who is ignorant.

source: །ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་མི་དམིགས་པས་འདོད་ཆགས་པ་མེད་པ། ཞེ་སྡང་བ་མེད་པ། གཏི་མུག་པ་མེད་པ། སེམས་ཕྱིན་ཅི་མ་ལོག་པ། མཉམ་པར་བཞག་པ་ཞེས་བྱའོ།
en: Because they do not see and do not perceive those phenomena they have no desire, they have no anger, they have no ignorance, their minds do not regress, and they rest in meditation.

source: །སྤྲོས་པ་མེད་པ་ཞེས་བྱའོ།
en: They are without conceptual elaboration.

source: །རྒལ་བ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: They have crossed over to the other side.

source: །སྐམ་ལ་ཕྱིན་པ་ཞེས་བྱའོ།
en: They have reached dry land.

source: །བདེ་བར་སོན་པ་ཞེས་བྱའོ།
en: They have reached safety.

source: །མི་འཇིགས་པ་ཐོབ་པ་ཞེས་བྱའོ། །ཚུལ་ཁྲིམས་ཅན་ཞེས་བྱའོ།
en: They have attained freedom from fear. They have correct conduct.

source: །ཡེ་ཤེས་ཅན་ཞེས་བྱའོ།
en: They have knowledge.

source: །ཤེས་རབ་ཅན་ཞེས་བྱའོ།
en: They have wisdom.

source: །བསོད་ནམས་ཅན་ཞེས་བྱའོ།
en: They have merit.

source: །རྫུ་འཕྲུལ་ཅན་ཞེས་བྱའོ།
en: They have miraculous powers.

source: །དྲན་པ་ཅན་ཞེས་བྱའོ། །བློ་གྲོས་ཅན་ཞེས་བྱའོ། །རྟོགས་པ་ཅན་ཞེས་བྱའོ། །ངོ་ཚ་ཤེས་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: They have memory. They have intelligence. They have realization. They have a sense of modesty.

source: །བརྟན་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: They have stability.

source: །སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: They have bodhisattva conduct.

source: །སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: They have the austerity of the disciplines of mendicancy.

source: །ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱའོ། །ཅི་འང་མེད་པ་ཞེས་བྱའོ།
en: They are unblemished. They have nothing.

source: །དགྲ་བཅོམ་པ་ཞེས་བྱའོ།
en: They are arhats.

source: །ཟག་པ་ཟད་པ་ཞེས་བྱའོ།
en: Their defilements have ceased.

source: །ཉོན་མོངས་པ་མེད་པ།
en: They have no kleśas.

source: དབང་དང་ལྡན་པར་གྱུར་པ།
en: They have power.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds are liberated. Their wisdom is liberated.

source: ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They are thoroughbred stallions. They are great elephants. They have done what had to be done. They have accomplished what had to be accomplished.

source: ཁུར་བོར་བ།
en: They have put down their burden.

source: བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They have reached their goals.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: They have ended engagement with existence.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They have liberated their minds through true knowledge.

source: སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དགེ་སྦྱོང་ཞེས་བྱའོ། །བྲམ་ཟེ་ཞེས་བྱའོ། །ཁྲུས་བྱས་པ་ཞེས་བྱའོ། །ཕ་རོལ་ཏུ་སོང་བ་ཞེས་བྱའོ།
en: They are mendicants who have attained all the perfect, highest, complete powers of the mind.

source: །རིག་པར་བྱེད་པ་ཞེས་བྱའོ། །གཙང་སྦྲ་ཅན་ཞེས་བྱའོ། །སངས་རྒྱས་ཀྱི་སྲས་ཞེས་བྱའོ། །ཤཱཀྱའི་སྲས་ཞེས་བྱའོ། །ཚེར་མ་དཀྲུགས་པ་ཞེས་བྱའོ།
en: They are brahmins. They are snātakas. They are masters of the Vedas. They know the Vedas. They are śrotriyas. They are children of the buddhas.

source: །ཁྲིམས་མ་དྲལ་བ་ཞེས་བྱའོ། །འོབས་དྲལ་བ་ཞེས་བྱའོ། །འོབས་ལས་རྒལ་བ་ཅེས་བྱའོ། །ཟུག་རྔུ་ཕྱུང་བ་ཅེས་བྱའོ། །ནད་མེད་པ་ཅེས་བྱའོ།
en: They are children of the Śākya. They have crushed the thorns. They have not left the law behind. They have left the trench barrier behind. They have crossed over the trench barrier. They have extracted the splinters. They have no illness. They are bhikṣus.

source: །དགེ་སློང་ཞེས་བྱའོ། །ཀུན་ནས་དཀྲིས་པ་མེད་པ་ཞེས་བྱའོ།
en: They are free from all bondage.

source: །སྐྱེས་བུ་ཞེས་བྱའོ།
en: They have been born as humans.

source: །སྐྱེས་བུ་དམ་པ་ཞེས་བྱའོ།
en: They are good humans.

source: །སྐྱེས་བུ་མཆོག་ཅེས་བྱའོ། །སྐྱེས་བུ་ཆེན་པོ་ཞེས་བྱའོ། །སྐྱེས་བུ་སེང་གེ་ཞེས་བྱའོ། །སྐྱེས་བུ་གླང་པོ་ཆེ་ཞེས་བྱའོ། །སྐྱེས་བུ་ཅང་ཤེས་པ་ཞེས་བྱའོ། །སྐྱེས་བུ་ལྕིད་ཁྱེར་བ་ཅེས་བྱའོ།
en: They are supreme humans. They are great humans.

source: །སྐྱེས་བུ་དཔའ་བོ་ཅེས་བྱའོ། །སྐྱེས་བུ་རྩལ་པོ་ཆེ་ཞེས་བྱའོ། །སྐྱེས་བུ་མེ་ཏོག་ཅེས་བྱའོ། །སྐྱེས་བུ་པད་མ་ཞེས་བྱའོ། །སྐྱེས་བུ་པད་མ་དཀར་པོ་ཞེས་བྱའོ།
en: They are human lions. They are human elephants. They are human stallions. They are human carthorses. They are human heroes. They are human strongmen. They are human flowers. They are human lotuses. They are human white lotuses. They are human tamers. They are human moons. They are extraordinary humans.

source: །སྐྱེས་བུ་འདུལ་བ་ཞེས་བྱའོ།
en: They are stainless humans.”

source: །སྐྱེས་བུ་ཟླ་བ་ཞེས་བྱའོ། །སྐྱེས་བུ་ཕལ་པ་མ་ཡིན་པ་ཞེས་བྱའོ། །མི་གོས་པ་ཞེས་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཟབ་མོའི་བཟོད་པ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Then the Bhagavān, in order to give this Dharma teaching on entering the patience of profound Dharma, recited these verses:

source: །ནམ་ཞིག་འཇིག་རྟེན་ཁམས་འདི་འབྱུང་བ་དང་། །འཇིག་རྟེན་ཐམས་ཅད་ནམ་མཁར་གྱུར་པའི་ཚེ།
en: “At one time a world appears, And later the entire world becomes space.

source: །ཇི་ལྟར་སྔོན་བཞིན་ཕྱིས་ཀྱང་དེ་བཞིན་ཏེ།
en: As it was before, so it is afterward.

source: །ཆོས་རྣམས་ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས།
en: Know that all phenomena are like that. {1}

source: །འཇིག་རྟེན་འདི་ན་ཇི་སྙེད་ཅི་ཡོད་པ།
en: “All that there is in this world

source: །ཆུ་ཡི་ཕུང་པོ་འདི་ནི་འོག་ཏུ་འགྲོ །འོག་ཏུ་ཅི་འདྲར་སྟེང་དུའང་དེ་བཞིན་ཏེ།
en: Later dissolves into the mass of water below. As it is below, so it is above.

source: །ཇི་ལྟར་བར་སྣང་ཅུང་ཟད་སྤྲིན་མེད་ལས།
en: “Just as in a completely cloudless sky

source: །སྐད་ཅིག་ཏུ་ནི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་སྣང་།
en: In an instant a mass of clouds appears—

source: །ཐོག་མ་ག་ལས་བྱུང་བར་ཤེས་པར་བྱ།
en: From where did they first originate?

source: །དེ་བཞིན་ཆོས་རྣམས་ཐམས་ཅད་ཤེས་པར་གྱིས།
en: Know that all phenomena are like that. {3}

source: །དེ་བཞིན་གཤེགས་པ་མྱ་ངན་འདས་པ་དག །ཇི་ལྟར་ཡིད་ལ་བྱས་བཞིན་གཟུགས་བརྙན་སྣང་།
en: “If you think of a tathāgata who has passed into nirvāṇa, His image will appear in your mind.

source: །སྔོན་མཐའ་ཇི་བཞིན་ཕྱིས་ཀྱང་དེ་བཞིན་ཏེ།
en: As he was before, so he is afterward.

source: །ཇི་ལྟར་དབུ་བ་མང་པོ་རྡོས་པ་དག །ཆུ་བོས་ཁྱེར་བ་སྐྱེས་བུས་ངེས་མཐོང་སྟེ།
en: “When a person sees a mass of foam That is carried along in a river

source: །དེ་ལ་བརྟགས་ན་སྙིང་པོ་ཡོང་མི་སྣང་།
en: And examines it, they see that it has no essence.

source: །ཇི་ལྟར་ཆར་པའི་ཐིགས་ཆེན་བབ་པ་ན།
en: “When large drops of rain fall,

source: །ཆུ་ཡི་ཆུ་བུར་དག་ནི་ཐ་དད་འབྱུང་།
en: There appear separate bubbles of water. They vanish as they appear;

source: །བྱུང་ནས་ཞིག་སྟེ་ཆུ་ཡི་ཆུ་བུར་མེད།
en: the bubbles have no existence.

source: །ཇི་ལྟར་སྤྲིང་ཡིག་གྲོང་གཞན་བསྐུར་བ་ལས།
en: “When a letter is sent to another town

source: །དགེ་དང་མི་དགེའི་བྱ་བ་སོ་སོར་འབྱུང་།
en: With news of the good or bad that has been done,

source: །སྒྲ་ལས་སྤྲིང་ཡིག་ཏུ་ཡང་འཕོས་པ་མེད།
en: A voice does not accompany the letter.

source: །ཇི་ལྟར་མི་དག་ཆང་གིས་མྱོས་ནས་ནི།
en: “When a man is intoxicated from alcohol,

source: །ས་འདི་ཀུན་ཏུ་འཁོར་སྙམ་བྱེད་མོད་ཀྱི།
en: He perceives the ground to be spinning,

source: །ས་འདི་འགུལ་ཞིང་གཡོས་པའང་མེད་པ་ལྟར།
en: But the earth is not moving or shaking.

source: །ཆོས་རྣམས་ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས། །མེ་ལོང་ངོས་དང་འབྲུ་མར་སྣོད་རྣམས་ལ།
en: Know that all phenomena are like that. {8}

source: །བུད་མེད་ཁ་བཞིན་རྒྱན་པས་བལྟས་པ་ན།
en: “A woman sees her beautified face On the surface of a mirror or a bowl of oil.

source: །བྱིས་པ་དེ་ནི་དེ་ལ་ཆགས་བསྐྱེད་ནས།
en: The fool feels passion for it

source: །འདོད་པ་ཚོལ་བའི་ཕྱིར་ཡང་ཤིན་ཏུ་རྒྱུག །བཞིན་ནི་དེར་ཡང་འཕོས་པ་མ་ཡིན་ཏེ།
en: And runs in search for the desired. {9} “The face was not transferred there.

source: །གཟུགས་བརྙན་ལ་ནི་ནམ་ཡང་བཞིན་མི་རྙེད།
en: The face will never be found in the reflection,

source: །རྨོངས་པ་དེ་དག་འདོད་ཆགས་སྐྱེས་པ་ལྟར།
en: And yet fools have desire for it.

source: །ཇི་ལྟར་སྨིག་རྒྱུ་དྲི་ཟའི་གྲོང་ཁྱེར་དང་། །སྒྱུ་མ་ཇི་བཞིན་རྨི་ལམ་ཇི་ལྟ་བུར།
en: “Just like optical illusions and fata morganas, Just like dreams and just like illusions,

source: །མཚན་མ་སྒོམ་པ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་།
en: When their attributes are meditated on, their nature is empty.

source: །ཇི་ལྟར་ནམ་མཁའ་དང་བར་ཟླ་ཤར་བ།
en: “When the moon is in a clear sky,

source: །དེ་ཡི་གཟུགས་བརྙན་དང་བའི་མཚོར་སྣང་སྟེ།
en: Its reflection appears on the sea,

source: །ཟླ་བ་ཆུ་ཡི་ནང་དུ་འཕོས་པ་མེད།
en: But the moon has not moved onto the water.

source: །ཆོས་ཀུན་མཚན་ཉིད་དེ་འདྲར་ཤེས་པར་གྱིས།
en: Know that all phenomena are like that. {12}

source: །ཇི་ལྟར་མི་དག་ནགས་རིའི་ཁྲོད་འདུག་ནས།
en: “A man who is inside a canyon

source: །གླུ་ལེན་སྨྲ་དང་རྒོད་དང་ངུ་བ་ལས། །བྲག་ཅ་ཐོས་ཀྱང་སྣང་བ་མེད་པ་ལྟར།
en: Sees no one but hears the echoes Of singing, speaking, and laughter.

source: །གླུ་དང་རོལ་མོ་དེ་བཞིན་ངུ་བ་ཡང་།
en: “Echoes are produced By songs, music, and weeping,

source: །དེ་ལ་བརྟེན་ནས་བྲག་ཅ་འབྱུང་མོད་ཀྱི། །སྒྲ་ལ་དབྱངས་དེ་ནམ་ཡང་ཡོད་མ་ཡིན།
en: But the song that is heard does not exist.

source: །ཇི་ལྟར་རྨི་ལམ་ན་ཡང་འདོད་བསྟེན་པ།
en: “Although pleasures are enjoyed in a dream,

source: །སྐྱེས་བུ་སད་པར་གྱུར་ནས་མི་མཐོང་སྟེ།
en: When the person awakes they are not be seen.
